"ActionType": ConnectionAcknowledged,
"AdditionalFields": {
	"direction": "In",
	"Source Mac": "00:15:5d:00:a8:01",
	"Destination Mac": "00:15:5d:84:b8:55",
	"Tcp Flags": 18,
	"Packet Size": 66
},
"AppGuardContainerId": ,
"DeviceId": 7e762df62731eb6471840a8382a3be818ac01bd4,
"DeviceName": red5,
"InitiatingProcessAccountDomain": ,
"InitiatingProcessAccountName": ,
"InitiatingProcessAccountObjectId": ,
"InitiatingProcessAccountSid": ,
"InitiatingProcessAccountUpn": ,
"InitiatingProcessCommandLine": ,
"InitiatingProcessFileName": ,
"InitiatingProcessFolderPath": ,
"InitiatingProcessId": 0,
"InitiatingProcessIntegrityLevel": ,
"InitiatingProcessMD5": ,
"InitiatingProcessParentFileName": ,
"InitiatingProcessParentId": 0,
"InitiatingProcessSHA1": ,
"InitiatingProcessSHA256": ,
"InitiatingProcessTokenElevation": None,
"InitiatingProcessFileSize": ,
"InitiatingProcessVersionInfoCompanyName": ,
"InitiatingProcessVersionInfoProductName": ,
"InitiatingProcessVersionInfoProductVersion": ,
"InitiatingProcessVersionInfoInternalFileName": ,
"InitiatingProcessVersionInfoOriginalFileName": ,
"InitiatingProcessVersionInfoFileDescription": ,
"LocalIP": 172.27.129.157,
"LocalIPType": ,
"LocalPort": 50711,
"MachineGroup": ,
"Protocol": TcpV4,
"RemoteIP": 23.213.161.16,
"RemoteIPType": ,
"RemotePort": 443,
"RemoteUrl": ,
"ReportId": 17470,
"Timestamp": 2024-10-16T18:45:41.6949457Z,
"InitiatingProcessParentCreationTime": ,
"InitiatingProcessCreationTime": ,
"InitiatingProcessSessionId": ,
"IsInitiatingProcessRemoteSession": false,
"InitiatingProcessRemoteSessionDeviceName": ,
"InitiatingProcessRemoteSessionIP": ,
"SourceSystem": ,
"Type": DeviceNetworkEvents

----------------------------------
